# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и
# сохраните в переменные, выведите на экран.

a = 200
print(a)
money = 100
print(money)
text = "Hello World!"
print(text)

name = input("Введите ваше имя - ")
surname = input("Введите вашу фамилию - ")
print('Здравствуйте,',surname ,name,',приятно познакомиться !')

num1 = input("Введите первое число - ")
num2 = input('Введите второе число - ')
sum = int(num1) + int(num2)
print('Сумма чисел будет равна',sum)




